package ru.bis.cc.utils;

import java.util.HashMap;
import java.util.Map;

public class BankInfo {
    private static final Map<String, String> bankInfo = new HashMap<>();

    static {
        prepareBankInfo();
    }

    public static String getBankName(String bic) {
        return bankInfo.getOrDefault(bic, "аЮМЙ ОНКСВЮРЕКЪ");
    }

    private static void prepareBankInfo() {
        bankInfo.put("044525101", "ннн \"дНИВЕ аЮМЙ\"");
        bankInfo.put("045655718", "оемгемяйхи пт юн \"пняяекэунгаюмй\"");
        bankInfo.put("004525987", "цс аюмйю пняяхх он жтн//стй он лняйнбяйни накюярх, Ц лНЯЙБЮ");
        bankInfo.put("045004784", "мнбняхахпяйхи пт юн \"пняяекэунгаюмй\"");
        bankInfo.put("013601205", "нрдекемхе яюлюпю аюмйю пняяхх//стй ОН яЮЛЮПЯЙНИ НАКЮЯРХ, Ц яЮЛЮПЮ");
        bankInfo.put("044525555", "оюн \"аЮМЙ ояа\"");
        bankInfo.put("045655707", "оюн аюмй \"йсгмежйхи\"");
        bankInfo.put("044030910", "яюмйр-оерепаспцяйхи пт юн \"пняяекэунгаюмй\"");
        bankInfo.put("042520607", "аюийюкэяйхи аюмй оюн яаепаюмй");
        bankInfo.put("048952750", "лнпднбяйхи пт юн \"пняяекэунгаюмй\"");
        bankInfo.put("014030106", "яебепн-гюоюдмне цс аюмйю пняяхх//стй ОН Ц.яЮМЙР-оЕРЕПАСПЦС, Ц яЮМЙР-оЕРЕПАСПЦ");
        bankInfo.put("010702101", "нрдекемхе ярюбпнонкэ аюмйю пняяхх//стй ОН яРЮБПНОНКЭЯЙНЛС ЙПЮЧ, Ц яРЮБПНОНКЭ");
        bankInfo.put("044030786", "тхкхюк \"яюмйр-оерепаспцяйхи\" юн \"юкэтю-аюмй\"");
        bankInfo.put("045209822", "нляйхи пт юн \"пняяекэунгаюмй\"");
        bankInfo.put("042748878", "йюкхмхмцпюдяйхи пт юн \"пняяекэунгаюмй\"");
        bankInfo.put("015655003", "нрдекемхе оемгю аюмйю пняяхх//стй ОН оЕМГЕМЯЙНИ НАКЮЯРХ, Ц оЕМГЮ");
        bankInfo.put("041806647", "бнкцнцпюдяйне нрдекемхе ╧8621 оюн яаепаюмй");
        bankInfo.put("040507861", "опхлнпяйхи пт юн \"пняяекэунгаюмй\"");
        bankInfo.put("049690719", "вевемяйхи пт юн \"пняяекэунгаюмй\"");
        bankInfo.put("044525593", "юн \"юкэтю-аюмй\"");
        bankInfo.put("040349602", "йпюямндюпяйне нрдекемхе N8619 оюн яаепаюмй");
        bankInfo.put("046126793", "пъгюмяйхи пт юн \"пняяекэунгаюмй\"");
        bankInfo.put("043601978", "яюлюпяйхи пт юн \"пняяекэунгаюмй\"");
        bankInfo.put("044501002", "ноепюжхнммши деоюпрюлемр аюмйю пняяхх");
        bankInfo.put("049401710", "сдлспряйхи пт юн \"пняяекэунгаюмй\"");
        bankInfo.put("044030001", "яебепн-гюоюдмне цс аюмйю пняяхх");
        bankInfo.put("045655001", "нрдекемхе оемгю аюмйю пняяхх");
        bankInfo.put("043601001", "нрдекемхе яюлюпю аюмйю пняяхх");
        bankInfo.put("040702001", "нрдекемхе ярюбпнонкэ аюмйю пняяхх");
        bankInfo.put("044525232", "оюн \"лря-аюмй\"");
        bankInfo.put("018073401", "нрдекемхе-ма пеяосакхйю аюьйнпрнярюм аюмйю пняяхх//стй ОН пЕЯОСАКХЙЕ аЮЬЙНПРНЯРЮМ, Ц сТЮ");
    }
}
