package ru.bis.cc.utils;

import java.util.HashMap;
import java.util.Map;

public class PayerInfo {
    private static Map<String, String> payerInfo = new HashMap<>();

    static {
        preparePayerInfo();
    }

    public static String getPayerInfo(String payerAccount, PayerInfoType infoType) {
        String info = payerInfo.get(payerAccount);
        if (info != null) {
            String[] data = info.split(";");
            return data[infoType.ordinal()].trim();
        }
        return "";
    }

    private static void preparePayerInfo() {
        payerInfo.put("40817810800000000009", "Дорохов Иван Петрович;776521543603");
        payerInfo.put("42301810900000000002", "Дорохов Иван Петрович;776521543603");
        payerInfo.put("40817810200000000010", "Строганова Алла Васильевна;776589845449");
        payerInfo.put("40820810000000000003", "Мусагалиев Галымжан Орынбасарович;773265856597");
        payerInfo.put("40820810300000000004", "Тэйвз Джонатан;774325653268");
        payerInfo.put("40817810100000000013", "Кривко Жанна Аркадьевна;770565351400");
        payerInfo.put("40802810400000000003", "Кривко Жанна Аркадьевна;770565351400");
        payerInfo.put("40802810700000000004", "Балоян Фрунзик Ашотович;770165258750");
        payerInfo.put("40817810400000000014", "Балоян Фрунзик Ашотович;770165258750");
        payerInfo.put("40802810000000000005", "Клименко Тарас Семенович;770863254530");
        payerInfo.put("40820810600000000005", "Клименко Тарас Семенович;770863254530");
        payerInfo.put("40702810100000001350", "АО открытого типа Вертикаль;7705625484");
        payerInfo.put("40701810400000000201", "АО открытого типа Вертикаль;7705625484");
        payerInfo.put("40702810400000001351", "АО открытого типа Вертикаль;7705625484");
        payerInfo.put("40702810500000001361", "АО открытого типа Вертикаль;7705625484");
        payerInfo.put("40702810700000001352", "Закрытое акционерное общество Веселый молочник;5834652323");
        payerInfo.put("40702810000000001353", "Закрытое акционерное общество Веселый молочник;5834652323");
        payerInfo.put("40701810700000000202", "Закрытое акционерное общество Веселый молочник;5834652323");
        payerInfo.put("40807810900000000045", "Совместное предприятие Фаргус;7728651480");
        payerInfo.put("40807810200000000046", "Совместное предприятие Фаргус;7728651480");
        payerInfo.put("40807810600000000701", "Совместное предприятие Фаргус;7728651480");
        payerInfo.put("40807810100000000049", "Товарищество с огранич. ответственностью Ситфарм;7733652546");
        payerInfo.put("40807810500000000050", "Товарищество с огранич. ответственностью Ситфарм;7733652546");
        payerInfo.put("30109810200000000013", "ПАО БАНК \"КУЗНЕЦКИЙ\";5836900162");
        payerInfo.put("30109810500000000014", "АО \"Россельхозбанк\";7725114488");
        payerInfo.put("30603810900000000000", "ООО \"Дойче Банк\";7702216772");
        payerInfo.put("40702810900000001097", "Открытое акционерное общество \"Старомосковский государственный завод" +
                " по изготовлению стеклянных, оловянных, деревянных, металлических, а также пластиковых изделий" +
                " повышенной прочности\";7529690285");
        payerInfo.put("40702810900000001084", "Закрытое акционерное общество Веселый молочник, занимающееся" +
                " производством, переработкой и сбытом молочной продукции, такой как молоко, кефир, ряженка," +
                " творог, йогурт и прочее;7393443311");
        payerInfo.put("30231810000000000000", "DEUTSCHE BANK  AG LONDON;8446808825");
        payerInfo.put("47417810600000000000", "ООО \"Дойче Банк\";7702216772");
        payerInfo.put("40702810300000001354", "Закрытое акционерное общество Гермес; ");
        payerInfo.put("40911810000000000006", "ООО \"Дойче Банк\";7702216772");
        payerInfo.put("30424810100000000005", " ;1205714517");
    }
}
